Revit 2027 API
IFCHybridImport.UpdateElements Method
 Updates IFC Elements using AnyCAD.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> UpdateElements(
	Document doc,
	string file,
	IFCHybridImportOptions options
)
Public Function UpdateElements (
	doc As Document,
	file As String,
	options As IFCHybridImportOptions
) As IList(Of ElementId)
public:
IList<ElementId^>^ UpdateElements(
	Document^ doc,
	String^ file,
	IFCHybridImportOptions^ options
)
member UpdateElements :
        doc : Document *
        file : string *
        options : IFCHybridImportOptions -> IList<ElementId>
Parameters
doc Document
 Document to receive elements from the IFC file update.
file String
 Full path of the file to import.
options IFCHybridImportOptions
 The hybrid import options.
Return Value
IList<ElementId>
 Returns an array of ElementIds representing created or updated elements.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCHybridImport Class
Autodesk.Revit.DB.IFC Namespace